#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.vm_ssh_pk: Refreshing state... [id=d954ae0d1d3833d3233388a3aeb570e6f3e3663b]
random_string.state-sta-name: Refreshing state... [id=hj8tetzd]
random_string.vm-sta-name: Refreshing state... [id=r9yd8vb6]
azurerm_resource_group.vm-rg: Refreshing state... [id=/subscriptions/41e86ccc-90d0-4aee-9408-66e5e02bf3a0/resourceGroups/vm-rg]
azurerm_resource_group.state-rg: Refreshing state... [id=/subscriptions/41e86ccc-90d0-4aee-9408-66e5e02bf3a0/resourceGroups/tutorial-tfstate-rg]
azurerm_public_ip.vm_public_ip: Refreshing state... [id=/subscriptions/41e86ccc-90d0-4aee-9408-66e5e02bf3a0/resourceGroups/vm-rg/providers/Microsoft.Network/publicIPAddresses/vm-public-ip]
azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/41e86ccc-90d0-4aee-9408-66e5e02bf3a0/resourceGroups/vm-rg/providers/Microsoft.Network/virtualNetworks/tutorial-vnet]
azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/41e86ccc-90d0-4aee-9408-66e5e02bf3a0/resourceGroups/vm-rg/providers/Microsoft.Network/networkSecurityGroups/tutorial-network-security-group]
azurerm_storage_account.vm-sta: Refreshing state... [id=/subscriptions/41e86ccc-90d0-4aee-9408-66e5e02bf3a0/resourceGroups/vm-rg/providers/Microsoft.Storage/storageAccounts/tutorialtfr9yd8vb6]
azurerm_storage_account.state-sta: Refreshing state... [id=/subscriptions/41e86ccc-90d0-4aee-9408-66e5e02bf3a0/resourceGroups/tutorial-tfstate-rg/providers/Microsoft.Storage/storageAccounts/tutorialtfhj8tetzd]
azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/41e86ccc-90d0-4aee-9408-66e5e02bf3a0/resourceGroups/vm-rg/providers/Microsoft.Network/virtualNetworks/tutorial-vnet/subnets/tutorial-subnet]
azurerm_network_interface.nic: Refreshing state... [id=/subscriptions/41e86ccc-90d0-4aee-9408-66e5e02bf3a0/resourceGroups/vm-rg/providers/Microsoft.Network/networkInterfaces/vm-nic]
azurerm_network_interface_security_group_association.nic_nsg: Refreshing state... [id=/subscriptions/41e86ccc-90d0-4aee-9408-66e5e02bf3a0/resourceGroups/vm-rg/providers/Microsoft.Network/networkInterfaces/vm-nic|/subscriptions/41e86ccc-90d0-4aee-9408-66e5e02bf3a0/resourceGroups/vm-rg/providers/Microsoft.Network/networkSecurityGroups/tutorial-network-security-group]
azurerm_linux_virtual_machine.vm: Refreshing state... [id=/subscriptions/41e86ccc-90d0-4aee-9408-66e5e02bf3a0/resourceGroups/vm-rg/providers/Microsoft.Compute/virtualMachines/tutorial-vm]
azurerm_storage_container.core-container: Refreshing state... [id=https://tutorialtfhj8tetzd.blob.core.windows.net/tutorial-core-tfstate]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.vm must be replaced
-/+ resource "azurerm_linux_virtual_machine" "vm" {
      - encryption_at_host_enabled      = false -> null
      ~ id                              = "/subscriptions/41e86ccc-90d0-4aee-9408-66e5e02bf3a0/resourceGroups/vm-rg/providers/Microsoft.Compute/virtualMachines/tutorial-vm" -> (known after apply)
        name                            = "tutorial-vm"
      ~ private_ip_address              = "10.0.1.4" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.0.1.4",
        ] -> (known after apply)
      ~ public_ip_address               = "20.9.70.59" -> (known after apply)
      ~ public_ip_addresses             = [
          - "20.9.70.59",
        ] -> (known after apply)
      - secure_boot_enabled             = false -> null
      - tags                            = {} -> null
      ~ virtual_machine_id              = "b9b2fd41-1b0b-4617-82c7-b20a26ba9e28" -> (known after apply)
      - vtpm_enabled                    = false -> null
        # (14 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ name                      = "tutorial-vm_OsDisk_1_9591766923564162a0ca93a1c9e30f79" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ source_image_reference {
          ~ sku       = "18.04-LTS" -> "16.04-LTS" # forces replacement
            # (3 unchanged attributes hidden)
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @moazrai, Action: `pull_request`*